testFiles/results_one_thread_6GB_bench/memtier_oomd_no_freeze.out
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  40 secs]  0 threads:       40782 ops,    1132 (avg:    1015) ops/sec, 823.68MB/sec (avg: 739.28MB/sec), 439.16 (avg: 492.45) msec latency

1         Threads
50        Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets           92.40          ---          ---       512.99890       514.04700       655.35900       679.93500    756983.39 
Gets          917.65         0.00       917.65       490.40171       528.38300       675.83900       720.89500        35.76 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       1010.05         0.00       917.65       492.45852       528.38300       671.74300       720.89500    757019.15 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET     173.055        0.000
SET     432.127        5.000
SET     444.415       10.000
SET     454.655       15.000
SET     464.895       20.000
SET     475.135       25.000
SET     483.327       30.000
SET     493.567       35.000
SET     499.711       40.000
SET     507.903       45.000
SET     514.047       50.000
SET     518.143       52.500
SET     520.191       55.000
SET     524.287       57.500
SET     528.383       60.000
SET     532.479       62.500
SET     536.575       65.000
SET     540.671       67.500
SET     544.767       70.000
SET     548.863       72.500
SET     552.959       75.000
SET     552.959       76.250
SET     557.055       77.500
SET     557.055       78.750
SET     561.151       80.000
SET     565.247       81.250
SET     565.247       82.500
SET     569.343       83.750
SET     573.439       85.000
SET     577.535       86.250
SET     581.631       87.500
SET     581.631       88.125
SET     585.727       88.750
SET     585.727       89.375
SET     589.823       90.000
SET     589.823       90.625
SET     593.919       91.250
SET     593.919       91.875
SET     598.015       92.500
SET     602.111       93.125
SET     606.207       93.750
SET     610.303       94.062
SET     610.303       94.375
SET     614.399       94.688
SET     614.399       95.000
SET     618.495       95.312
SET     618.495       95.625
SET     622.591       95.938
SET     626.687       96.250
SET     626.687       96.562
SET     630.783       96.875
SET     630.783       97.031
SET     634.879       97.188
SET     634.879       97.344
SET     634.879       97.500
SET     638.975       97.656
SET     638.975       97.812
SET     638.975       97.969
SET     643.071       98.125
SET     643.071       98.281
SET     647.167       98.438
SET     647.167       98.516
SET     647.167       98.594
SET     647.167       98.672
SET     651.263       98.750
SET     651.263       98.828
SET     651.263       98.906
SET     655.359       98.984
SET     655.359       99.062
SET     655.359       99.141
SET     655.359       99.219
SET     659.455       99.258
SET     659.455       99.297
SET     659.455       99.336
SET     659.455       99.375
SET     663.551       99.414
SET     663.551       99.453
SET     663.551       99.492
SET     663.551       99.531
SET     667.647       99.570
SET     667.647       99.609
SET     671.743       99.629
SET     671.743       99.648
SET     671.743       99.668
SET     671.743       99.688
SET     671.743       99.707
SET     671.743       99.727
SET     671.743       99.746
SET     675.839       99.766
SET     675.839       99.785
SET     675.839       99.805
SET     679.935       99.814
SET     679.935       99.824
SET     679.935       99.834
SET     679.935       99.844
SET     679.935       99.854
SET     679.935       99.863
SET     679.935       99.873
SET     679.935       99.883
SET     688.127       99.893
SET     688.127       99.902
SET     688.127       99.907
SET     688.127       99.912
SET     688.127       99.917
SET     696.319       99.922
SET     696.319       99.927
SET     696.319       99.932
SET     696.319       99.937
SET     696.319       99.941
SET     704.511       99.946
SET     704.511       99.951
SET     704.511       99.954
SET     704.511       99.956
SET     704.511       99.958
SET     704.511       99.961
SET     704.511       99.963
SET     704.511       99.966
SET     704.511       99.968
SET     704.511       99.971
SET     712.703       99.973
SET     712.703      100.000
---
GET       0.391        0.000
GET      61.183        5.000
GET     193.535       10.000
GET     444.415       15.000
GET     462.847       20.000
GET     477.183       25.000
GET     489.471       30.000
GET     499.711       35.000
GET     509.951       40.000
GET     518.143       45.000
GET     528.383       50.000
GET     532.479       52.500
GET     536.575       55.000
GET     544.767       57.500
GET     548.863       60.000
GET     552.959       62.500
GET     561.151       65.000
GET     565.247       67.500
GET     569.343       70.000
GET     577.535       72.500
GET     581.631       75.000
GET     585.727       76.250
GET     585.727       77.500
GET     589.823       78.750
GET     593.919       80.000
GET     593.919       81.250
GET     598.015       82.500
GET     602.111       83.750
GET     606.207       85.000
GET     610.303       86.250
GET     614.399       87.500
GET     614.399       88.125
GET     618.495       88.750
GET     618.495       89.375
GET     622.591       90.000
GET     622.591       90.625
GET     626.687       91.250
GET     626.687       91.875
GET     630.783       92.500
GET     634.879       93.125
GET     634.879       93.750
GET     638.975       94.062
GET     638.975       94.375
GET     638.975       94.688
GET     643.071       95.000
GET     643.071       95.312
GET     647.167       95.625
GET     647.167       95.938
GET     651.263       96.250
GET     651.263       96.562
GET     655.359       96.875
GET     655.359       97.031
GET     655.359       97.188
GET     659.455       97.344
GET     659.455       97.500
GET     659.455       97.656
GET     663.551       97.812
GET     663.551       97.969
GET     663.551       98.125
GET     667.647       98.281
GET     667.647       98.438
GET     667.647       98.516
GET     671.743       98.594
GET     671.743       98.672
GET     671.743       98.750
GET     671.743       98.828
GET     671.743       98.906
GET     675.839       98.984
GET     675.839       99.062
GET     675.839       99.141
GET     675.839       99.219
GET     675.839       99.258
GET     679.935       99.297
GET     679.935       99.336
GET     679.935       99.375
GET     679.935       99.414
GET     679.935       99.453
GET     684.031       99.492
GET     684.031       99.531
GET     684.031       99.570
GET     688.127       99.609
GET     688.127       99.629
GET     688.127       99.648
GET     688.127       99.668
GET     688.127       99.688
GET     692.223       99.707
GET     696.319       99.727
GET     696.319       99.746
GET     696.319       99.766
GET     704.511       99.785
GET     704.511       99.805
GET     704.511       99.814
GET     704.511       99.824
GET     712.703       99.834
GET     712.703       99.844
GET     712.703       99.854
GET     712.703       99.863
GET     712.703       99.873
GET     720.895       99.883
GET     720.895       99.893
GET     720.895       99.902
GET     720.895       99.907
GET     720.895       99.912
GET     720.895       99.917
GET     720.895       99.922
GET     720.895       99.927
GET     729.087       99.932
GET     729.087       99.937
GET     729.087       99.941
GET     729.087       99.946
GET     729.087       99.951
GET     737.279       99.954
GET     737.279       99.956
GET     737.279       99.958
GET     737.279       99.961
GET     737.279       99.963
GET     737.279       99.966
GET     737.279       99.968
GET     737.279       99.971
GET     737.279       99.973
GET     737.279       99.976
GET     745.471       99.977
GET     745.471      100.000
---
WAIT      0.000      100.000